app/controllers/admin/admin_sessions_controller.rb

  def create
    if User.find_by_login_or_email(params[:user_session][:login]).roles.collect(&:title).include?("admin")
---
SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 8 )
SELECT * FROM `users` WHERE (`users`.`login` = 'admin') LIMIT 1